{"Harry Potter and the Sorcerer's Stone": ["They start talking about what happened that day and saying that even the Muggles must have noticed something is going on.Dubledore states that the night before, Voldemort turned up in Godric's Hollow to find Lily and James Potter, which are rumoured to be dead.Harry has a lightning bolt scar on his forehead.", "Chapter 1-2 The Vanishing Glass Ten years have passed and Harry is almost eleven.On family outings, Harry would normally be made to stay with a neighbor, Mrs. Figg.Harry talks to a boa constrictor (snake) and sets it free, making the glass from it's cage vanish.", "It is decided that next year Dudley will go to Uncle Vernon's old school, Smeltings.A letter arrives for Harry in the post, but Uncle Vernon does not let him have it.After the letters start coming through the chimney, Uncle Vernon decides they will leave the house.", "Chapter 1-4 The Keeper of the Keys Hagrid, a giant man arrives.He finds out Harry knows nothing at all about his past and his parents' world, nor that his parents and he are magical and he is famous.Harry is amazed to learn that he is a wizard.", "Chapter 1-5 Diagon Alley In the morning, when Harry wakes up, an owl arrives bringing a newspaper.Harry pays it five Knuts from Hagrid's pocket.To buy Harry's school supplies, they go to the Wizard's bank Gringotts, where Harry's parents left him their gold.", "The Dursleys leave, but Harry can't find the platform.She explains to Harry that he should 'walk right through the wall'.After going through the wall he arrives on the platform where the Hogwarts Express is already waiting.", "In the Great Hall they will first undergo the Sorting Ceremony using the Sorting Hat, an old wizard's hat.Hermione tells those around her that the ceiling was bewitched to look like the sky outside.Dumbledore tells the students that he was asked by Mr. Filch, the caretaker, to remind them that no magic may be used between classes in the corridor.", "Chapter 1-8 The Potions Master Harry is trying to get familiar with the school.He finds out that Argus Filch knows all that happens here and is very eager to catch students doing things they're not supposed to.Harry's Charms teacher is a tiny little wizard called Professor Flitwick.", "Chapter 1-9 The Midnight Duel During breakfast Neville receives a Remembrall from his grandmother.In the afternoon, Harry has his first flying, which is taught by Madam Hooch.Draco flies away with the remembrall which Neville lost during his fall and Harry chases him.", "Chapter 1-10 Halloween During breakfast, Harry gets his Nimbus Two Thousand by owl-post.Draco, seizing the package, is startled to find out from Professor Flitwick that Harry is allowed a broom, while no first year is allowed to have one at school.At night Harry has his first Quidditch training.", "Chapter 1-11 Quidditch Harry is scheduled to play in his his first Quidditch match between Gryffindor and Slytherin.Harry has his first live match experience with it's Bludgers, Quaffle and the Snitch.During the game Harry's Nimbus Two Thousand is going crazy, almost throwing Harry off.", "They do not find him in any of the common books.Students are not allowed to look in the Restricted Section of the library without special permission in the form of a signed note from one of the teachers.When dinner was finished, Harry is laden down with things he had gotten out of the crackers, including a pack of non-explodable luminous balloons, a Grow-Your-Own-Warts kit, and his own new wizard chess set.", "Chapter 1-13 Nicolas Flamel Harry has nightmares about his parents disappearing in a flash of green light, while a high voice cackles with laughter.Harry finds out that Snape will be referee for his next Quidditch match.At that moment Neville topples into the common room, his legs stuck together by a Leg-Locker Curse, put on him by Draco Malfoy.", "It is against the law to keep a Dragon, as dragon breeding was outlawed by the Warlock's Convention of 1709.Hagrid shows them a dragon egg he won the night before from a stranger.They send Charlie a letter by owl and he writes them back telling them he would be glad to take the dragon and that he will ask some friends to pick it up at midnight on saturday from the tallest tower of Hogwarts.", "About a week before exams, Harry overhears Quirrell and Snape talking, and they suspect that Snape now knows how to get by all the obstacles that are protecting the Sorcerer's Stone.Harry, Neville, Hermione and also Malfoy who got detention earlier have to go with Hagrid and Fang into the forbidden forest.A unicorn has been hurt badly, the second time in one week since Hagrid found one dead last wednesday.", "Chapter 1-16 Through the Trapdoor The final exams of the first year begin.Hermione complains she needn't have learned about the 1637 Werewolf Code of Conduct or the uprising of Elfric the Eager.Harry is worried about his hurting scar and restless, feeling he forgot something.", "Chapter 1-17 The Man with Two Faces Quirrell, not Snape, turns out to be in the room.He has been the one going after the Sorcerer's Stone the whole time.By magic, out of nowhere ropes spring out of thin air and wrapping Harry tightly."], "Harry Potter and the Half-Blood Prince": ["One of the portraits in the office announces the arrival of Fudge and he arrives by Floo Network.Rufus Scrimgeour, the new Minister of Magic arrives through the fireplaces.", "Chapter 6-2 Spinner's End Bellatrix Lestrange is following Narcissa Malfoy trying to talk her out of going somewhere.Wormtail is also there being ordered by Voldemort to assist Snape, and is sent away to leave them alone.Bellatrix tells Snape she does not trust him and asks questions about his past actions.", "On the floor a leaflet from the Ministry about protecting home and family, including a rumor that the Death Eaters may be using Inferi.Dumbledore sent a letter telling Harry he can go to The Burrow and arrives at their house.He tells Harry that Sirius's will was discovered and leaving Harry all his possessions, including Grimmauld Place.", "Chapter 6-4 Horace Slughorn Dumbledore takes Harry on a side-along-Apparition and they set off to some destination.They arrive at some village of Budleigh Babberton where Dumbledore tells Harry they will be trying to persuade somebody to become a teacher again.It turns out that it is staged to look like some fight occurred, by the owner Horace Slughorn, who turns back into normal from having transfigured himself into a armchair.", "She sees Harry is taller like Ron, as though they had Stretching Jinxes put on them.She tells Harry that Slughorn taught her and Arthur too.He tells them he has been working, busy with fake Metamorph-Medals and a Backfiring Jinx.", "Chapter 6-6 Draco's Detour Harry stays at The Burrow.Bill got gold from his vault for Harry, because of tightened security he could do it faster.They get into an argument and Narcissa warns Ron and Hermione not to attack Draco.", "Harry has a quick word with Mr Weasley telling him about when he saw Draco in Borgin and Burkes.On the Hogwarts Express Harry meets again with Neville and Luna.A fourth-year girl, Romilda Vane, invites Harry to join their carriage but Harry declines.", "Chapter 6-8 Snape Victorious Harry lies paralyzed in the Hogwarts Express.She summons her Patronus to send word that she found Harry and she walks Harry to the Hogwarts gates.She tells Harry that she is stationed at Hogsmeade together with Proudfoot, Savage and Dawlish.", "Snape tells people he did not ask them to take out their books and Hermione hastily puts back her copy of Confronting the Faceless.Next he questions them about non-verbal spells, Hermione recites from The Standard Book of Spells (grade 6), and then they start practicing them.Complaining about Ron's performance Snape suddenly turns his wand on Harry who shouts a ¤ Protego.", "Dumbledore tells Harry in his private lessons he will be given certain information about Voldemort's life and history and why he attempted to kill Harry.Harry may tell Ron and Hermione but they should keep everything to themselves.", "Chapter 6-11 Hermione's Helping Hand Non-verbal spells are now expected in several classes.Hermione suggests they should visit Hagrid but Ron says they have Quidditch tryouts and he needs to practice the Aguamenti charm.Hermione mentions that people are afraid, the Patil twins' parents want them to go home and Eloise Midgeon has already been withdrawn.", "The Prince seems to have been inventing spells himself, including ¤ Muffliato, a spell that fills the ears of anyone nearby with a buzzing, and a spell ¤ Levicorpus (N-vbl).Harry supposes N-vbl must mean non-verbal and doubts he will be able to perform it.Harry suddenly remembers his father used this spell, but Hermione reminds him they also saw Death Eaters use it at the Quidditch World Cup.", "Chapter 6-13 The Secret Riddle Harry has another private meeting with Dumbledore.Dumbledore tells Harry that Katie was lucky she only brushed the necklace and that Snape managed to prevent rapid spread of the curse.Burke tells how Merope sold him her gold locket.", "Hermione tells Harry there will be a private Slug Club Chrismas party, and no way he can wriggle out of that one.Harry is uncomfortably watching and breaks a bowl, he uses ¤ Reparo to fix it, and Hermione dives flustered into her copy of Flesh-Eating Trees of the World.Dean turns out a good choice during practicing, only Ron is inconsistent due to nerves and lack of confidence.", "Chapter 6-15 The Unbreakable Vow Ron and Hermione are not speaking to each other.Hermione tells Harry he needs to be careful since a lot of girls, including Romilda Vane are discussing how to slip Harry a Love Potion.Harry and Hermione hear someone behind the bookshelves.", "Fred and George also came home for christmas, and Bill and Lupin are also coming.Mr Weasley tells Harry about the lack of success the Ministry has so far.Harry tells him too about Draco and Snape, and Lupin also listens in.", "Hermione has a scroll from Dumbledore for Harry with the date of his next private meeting.Ron tells the others Harry already once did a Side-Along-Apparation.Harry goes to his private meeting with Dumbledore, the Pensieve already waiting on his desk.", "Chapter 6-18 Birthday Surprises Hermione never heard about Horcruxes.Browsing more through the book, Harry sees a scribble saying 'just shove a Bezoar down their throats'.In a desperate attempt, his antidote is not progressing, Harry hurries down to the store cupboard and takes out a Bezoar.", "Chapter 6-19 Elf Tails Harry, Hermione and Ginny are in the hospital wing with Ron.Harry, Hermione and Hagrid leave, Hagrid says it will be difficult for Dumbledore to keep the school open with two attacks already, he says it's no wonder Dumbledore is angry with Snape.In the common room Cormac is waiting for him, he saw Ron being taken to the hospital wing and he wants the Keeper position.", "Chapter 6-20 Lord Voldemort's Request Harry and Ron may leave the hospital wing.Luna gives Harry a scroll from Dumbledore, his next private meeting is that evening.Ron does not seem much pleased anymore dating Lavender.", "Kreacher and Dobby pop in in the common room.Draco turns out to be breaking no rules, but keen to visit the seventh floor with a variety of other students who keep watch.Harry, Ron and Hermione realize he has been visiting the Room of Requirement.", "Harry suddenly thinks he might be able to get Slughorn's memory using the Felix Felicis potion.Some of the Montgomery sisters are not looking happy, their brother was attacked by a Werewolf and died, rumour goes it was Fenrir Greyback.At the end of the lesson, Slughorn is gone before Harry can ask about the memory.", "Dumbledore considered Riddle's Diary which Harry handed four years ago to him certain proof that Voldemort had split his soul.Harry already destroyed the Diary, Dumbledore found and destroyed the gold ring of Marvolo Gaunt recently.He likely reserved creating the last Horcrux with the killing of Harry, so to destroy the danger the prophecy had outlined.", "Chapter 6-24 Sectumsempra Harry tells Ron and Hermione about Slughorn and his memory.Harry has conflicting feelings about liking Ginny but her being Ron's sister.Katie has returned but she tells Harry she doesn't know who gave her the necklace.", "Harry receives a scroll and Dumbledore wants to see him right away.On his way he hears a scream, he finds Professor Trelawney who, Harry spots, was trying to get into the Room of Requirement.Harry thinks she should tell Dumbledore and they both walk to his office.", "Chapter 6-26 The Cave Harry and Dumbledore arrive near the cave.They climb down a cliff and enter the water, swimming to the cave.Harry offers some of his but Dumbledore does it himself, cutting his arm and they enter the opening.", "Harry wants to take him immediately to Madam Pomfrey but Dumbledore says it is Snape he needs.Rosmerta appears and Harry asks if Dumbledore can stay with her while he goes to Hogwarts to get help.Rosmerta asks him if he hasn't seen it, and then points out the Dark Mark in the sky above Hogwarts, meaning there has been a killing.", "Harry realizes he can move again, he casts a ¤ Petrificus Totalus at the last Death Eater is leaving through the door and he goes rigid.Greyback is grabbing Harry but Harry immobilizes him with a ¤ Petrificus Totalus.Ginny is in combat with Amycus, who is casting ¤ Crucio's at her.", "Chapter 6-29 The Phoenix Lament Hagrid says Harry should go inside, Ginny finally takes him back to into the castle.Nobody was killed, it was Bill who Harry had felt unconscious on the floor.They took Harry's Felix Felicis, otherwise they might all have been killed.", "Chapter 6-30 The White Tomb All lessons are suspended and examinations postponed.She did find wizards with the initials, Rosalind Antigone Bungs and Rupert Axebanger Brookstanton but they don't fit at all.Now Harry hates the fact that Snape, the Prince, has helped him so much."], "Harry Potter and the Deathly Hallows": [], "Harry Potter and the Goblet of Fire": ["Their house is still called 'The Riddle House'.She had found all three Riddles dead; their eyes wide open and cold as ice.He insist he's innocent, and that the only peron he saw near the house on the day of the Riddles' deaths was a pale, dark-haired teenage boy.", "Chapter 4-2 The scar Harry wakes up from his vivid dream, in pain from his burning scar.He tries to distract his mind with Flying with the Cannons but even that doesn't work.", "The Dursleys received a letter from the Weasley family, asking if Harry can go to the Quidditch World Cup with them.Harry just has to casually mention the word 'godfather' and he is allowed to go.He goes up to his room, where Errol has just arrived with Pig, Ron's new owl.", "Chapter 4-4 Back to The Burrow The next day, Harry packs his trunk and is set to go.Harry realises they have traveled here by using Floo Powder.Before Harry and Mr. Weasley can leave, they find out that Dudley found one of Fred's sweets and has eaten it.", "Chapter 4-5 Weasley's Wizard Wheezes Harry arrives at the Weasley's house, the Burrow.Fred asks if Dudley ate the Ton-Tongue Toffee.He tells them he is working on a report to standardise cauldron thickness for the Department of International Magical Co-operation.", "Chapter 4-6 The Portkey The next morning, everybody wakes up early to go to the World Cup.Bill, Charlie and Percy will go by Apparating.Mr. Weasley tells them a pair of people splinched themselves once, while trying to apparate, leaving half of themselves behind!", "Basil warns them they had better get out of the way since there is a big party coming in from the Black Forest.Harry, Ron and Hermione get water at the other end of the field.Bagman tells them he takes bets from people.", "Harry watches a review on his omnioculars in slow motion reading Krum doing the Wronski Feint.After a time out, the game starts again.The game is getting uglier and many fouls are comitted.", "Chapter 4-9 The Dark Mark Everybody goes back to the tents.From a distance, Harry sees a crowd of masked wizards coming their way.Harry, Ron and Hermione have lost the others and they continue together into the woods.", "Chapter 4-10 Mayhem at the Ministery After a few hours of sleep the whole group goes home.Harry tells Ron and Hermione that his scar hurt a short while ago and about Professor Trelawney's prediction.", "Harry sees Amos Diggory's head talking to Mr. Weasley in the middle of flames in the fireplace.Mr. Weasley asks what Mad-Eye said had happened and Amos tells him that Mad-Eye caught some intruders at his house.Bill explains to Harry that Moody, Mad-Eye Moody, is an old friend of Dumbledore's.", "Chapter 4-12 The Triwizard Tournament Arriving at the castle, they're 'welcomed' by Peeves with water bombs.The new students enter and the Sorting Ceremony starts.Nearly Headless Nick tells them Peeves made trouble earlier that evening, scaring all the House-elves.", "Chapter 4-13 Mad-Eye Moody The first day of school begins.Harry and Ron have Herbology with Professor Sprout first.Hanna Abbott tells them that a girl named Eloise Midgen had once tried to curse off her acne.", "Chapter 4-14 The Unforgivable Curses The next two days are calm.Harry has his first Defense Against the Dark Arts class from Professor Moody.First he shows them the Imperius Curse which exacts total control over a person or creature, using ¤ Imperio on a spider.", "Chapter 4-15 Beauxbatons and Durmstrang Worried about Sirius coming and the chance of him being caught, Harry writes him back to tell him that he is fine and that there is no need for him to come.After some of the other students seem helpless to the curse, it is Harry's turn.Moody puts an ¤ Imperio on him but Harry partly manages to resist it.", "Chapter 4-16 The Goblet of Fire There is a welcome dinner for the Durmstrang and Beauxbatons school delegations.At the end of dinner, Dumbledore stands up and announces the start of the Triwizard Tournament.Bagman and Crouch helped organize it and they will join himself, Karkaroff and Madame Maxime in the judging.", "Bagman comes in and tells the three other champions Harry is the fourth champion.Madam Maxime and Karkaroff protest to the fact that Hogwarts has 2 champions now.Dumbledore asks if Harry put his name in the Goblet himself or if he asked somebody to do it.", "Chapter 4-18 The Weighing of the Wands The day after the champions-selection, Ron is still angry.Hermione thinks it is obvious Harry didn't put his name in the Goblet himself.Hermione explains that Ron is simply jealous of Harry's fame; that he doesn't really believe Harry put his name in the Goblet himself.", "Chapter 4-19 The Hungarian Horntail Harry is nervous about the first Task.Rita Skeeter wrote an article filled with lies about him in the Daily Prophet, and the Slytherins tease him with it.There is a Hogsmeade trip and Harry wears his Invisibility Cloak so that he will not be bothered.", "They hypothesize about using Switching Spells and Transfiguring the dragon but can not think of easy ways.Harry also consults Basic Hexes for the Busy and Vexed.Harry is getting depressed and afraid at the prospect of the first task.", "Harry tells Ron about Karkaroff having been a Death Eater.The next they go to the common room for Harry's surprise party.Hermione takes Harry and Ron to the castle kitchens.", "After class she has a private word with Harry, telling him that he, as one of the Champions, will have to open the ball with their dance partners.Girls ask him to go with them but he says no. There is no article yet about Hagrid from Rita Skeeter.For the ball, Dumbledore has booked the Weird Sisters, a famous group which can be heard regularly on the Wizarding Wireless Network.", "He congratulates Harry for getting past the Horntail.On christmas day, Harry wakes up to find Dobby in his room.Harry and Ron give Dobby clothes as a present.", "Chapter 4-24 Rita Skeeter's Scoop Everybody gets up late the day after the Ball.Harry still hasn't managed to find out the clue of the golden egg.Malfoy tells them why Hagrid is not present, showing them an awfull article about him from Rita Skeeter in the Daily Prophet.", "Chapter 4-25 The Egg and the Eye Harry decides to take the golden egg to the bath in the Prefects' bathroom.He gets out of the bath and leaves the bathroom.On the map he sees Bartemius Crouch's name in Snape's office.", "They speculate about Snape possibly being involved in putting Harry's name in the Goblet.Harry also sends a letter to Sirius telling him what happened.The following days Harry, Ron and Hermione look for solutions to Harry's second task, which will require him to stay under water for an hour.", "Snape accuses Harry of breaking into his office.Snape shows Harry Veritaserum, a Truth Potion, threatening to use it on him.Harry deliberately knocks over a bottle to overhear the conversation after class.", "Harry asks Winky if she knows more about Mr. Crouch's whereabouts.Harry, Ron and Hermione send some food they got from the kitchen to Sirius.The Nifflers dig up Leprechaun gold that Hagrid has buried.", "Nobody wants to explain what they are doing.Harry receives a letter from Sirius saying he should have been more careful going out alone with Krum.They also make a list of hexes in the library for Harry to practice, including the Impediment Jinx which slows down anything.", "Chapter 4-30 The Pensieve Harry waits while Dumbledore accompanies Fudge and Moody downstairs.Harry sees Fawkes, the Sorting Hat and the sword of Godric Gryffindor.He also sees something shimmering from inside a black cabinet and checks it out.", "They speculate intensely about everyone Harry had seen.Ron and Hermione help Harry prepare for the third task, practicing charms and hexes like the Impediment Jinx.Professor McGonagall gives Harry permision to practice in the Transfiguration classroom.", "Chapter 4-32 Flesh, Blood and Bone Harry and Cedric come to a stop.Harry sees a green light, his Scar bursts again with pain and then the pain decreases.Wormtail ties Harry to a grave with the name Tom Riddle.", "The Death Eaters Apparate from thin air and form a circle around Harry.Voldemort explains that Lily Potter, Harry's mother, died attempting to save Harry.Voldemort uses the Cruciatus Curse ¤ Crucio again on Harry.", "Chapter 4-34 Priori Incantatem Harry has his Wand back.Harry manages to resist and hides behind the grave of Voldemort's father.The fight is about to end; Harry has nowhere to go.", "Chapter 4-35 Veritaserum Harry gets back to Hogwarts, bringing back Cedric's body.Amos Diggory is speeding to the scene to find out what happened.Harry is taken away by Moody to his office.", "Chapter 4-36 The Parting of the Ways Barty Crouch is tied up.Fawkes, the Phoenix, flies over to heal Harry's leg.Harry has to explain in detail about his encounter with Voldemort.", "Harry wants to give them the prize money but they do not accept it.Before going back home, there is a Leaving Feast.He announces that Cedric was murdered by Voldemort and that it was Harry who brought his body back at the risk of his own life."], "Harry Potter and the Chamber of Secrets": ["On Harry's birthday, sitting alone in the park, he spots a pair of green eyes staring back from a hedge.Harry has to stay in his room while he aunt and uncle entertain their guests.", "Dobby warns Harry not to go back to Hogwarts because if Harry does, he will be in mortal danger.Harry learns that Dobby has intercepted Ron and Hermione's letters to make Harry believe he had no friends at the school.When Harry refuses to promise not to return to Hogwarts, Dobby goes downstairs to the kitchen and levitates the dessert, a cream pudding that was to be served to Dursley's guests.", "Chapter 2-3 The Burrow Ron wakes Harry up.He heard about Harry being locked up from his father who works for the Ministry of Magic.After taking all his stuff and Hedwig they break out the bars, almost being caught by Uncle Vernon, and fly back to Ron's house.", "Ron and Harry receive a letter from Hermione.Ron tells her that Harry has never travelled by Floo Powder before.After explaining that you have to throw a bit of floo powder into the fireplace and clearly state the name of the place where you want to go while stepping into the fire, Harry steps into the fire.", "The car has been magically enhanced to be bigger from the inside then it looks on the outside.After having to go back for George's Filibuster fireworks, Fred's broom and Ginny's diary, they finally start on their way.With the gateway sealed, Ron suggests to take Mr. Weasley's car.", "Their first class that day is Herbology with Professor Sprout in the greenhouse outside the castle.They start repotting them, taking the pots and compost, carefully avoiding the Venemous Tentacula because it's teething.Harry, Ron and Hermione are joined by Justin Finch-Fletchley from Hufflepuff.", "Chapter 2-7 Mudbloods an Murmurs Harry leaves for Quidditch practice.He keeps asking Harry all kind of questions about Quidditch, walking after Harry untill Harry finally manages to shake him off when he reaches the changing rooms.Going back to the castle, Harry and Ron are told they will do detention at eight o'clock in the evening.", "Chapter 2-8 The Deathday Party October arrives and there is a spate of colds among the staff and students.Squelching along the deserted corridors one day Harry encounters Nearly Headless Nick, the ghost of Gryffindor Tower.At the end of his conversation with Nearly Headless Nick, Filch burst in the corridor and takes him to his office for dripping mud from his shoes all over the castle.", "Chapter 2-9 The writing on the Wall Filch thinks Harry killed his cat.Dumbledore takes Harry, Ron, Hermione and Filch with him to Professor Lockhart's office.Filch is convinced Harry did it since Harry found out he's a Squib.", "Chapter 2-10 The Rogue Bludger Since the pixies incident, Pofessor Lockhart brought no live creatures to classes.So far Harry played a Transylvanian villager whom Lockhart had cured of a Babbling Curse, a yeti and a vampire.In the current lesson Harry has to play a Werewolf, Lockhart showing how he managed to perform a complex Homorphus Charm.", "Chapter 2-11 The Dueling Club Harry is healed and is excused from the Hospital wing.Harry looks for Hermione and Ron and finds them in Moaning Myrtle's bathroom.Harry tells them what happened to Colin, which they already overheard Professor McGonagall telling Professor Flitwick.", "Chapter 2-12 The Polyjuice Potion Harry is left in Dumbledore's office.It reads Harry's thoughts about him wondering and says the dicision was hard, Harry would have done well in Slytherin.Harry sees that he's not alone, there's a bird on a golden perch which suddenly bursts into flames.", "Chapter 2-13 The Very Secret Diary Hermione had to stay in the hospital wing for several weeks.It turns out to be the diary of T.M.Riddle.Harry tells her about the diary they found that had belonged to T.M.", "Chapter 2-14 Cornelius Fudge Hagrid has always been fond off monsters as pets, but they are not one hundred percent sure it was him.As long as there are no more attacks they decide not to confront him.Harry ends up choosing the same subjects as Ron.", "Harry spots spiders during classes, all headed toward the Forbidden Forest.At night Ron and Harry sneak out of the school again using the Invisibility Cloak.Harry tells him that Hagrid is sent to Azkaban and that he is suspected of opening the Chamber of Secrets and setting a monster free.", "Chapter 2-16 The Chamber of Secrets Exams are still on, even with the attacks going on.Professor McGonagall announces in the Great Hall that the Mandrakes are ready for cutting and that the people who have been Petrified will be revived at night.Ginny Weasley joins them at the table, looking nervous and wanting to tell Ron and Harry something but she decides not to when Percy joins the table.", "The diary is lying on the floor near a giant statue.She finally became suspicous and tried to get rid of the diary, which Harry later found.For months his new target has been Harry.", "Harry explains everything what had happened, avoiding mentioning Riddle's diary or Ginny.Ron and Harry will both receive a Special Award for Services to the School.Although he can not prove it, Harry acuses him of putting the Diary into Ginny's bag in Flourish and Blotts."], "Harry Potter and the Order of the Phoenix": ["Chapter 5-1 Dudley Demented Harry is back at the Dursleys' at Privet Drive, lying hidden below a window in the garden so he can hear the tv news.Harry knows that Dudley and his gang have been around vandalising the neighbourhood instead.Sudenly there's a loud crack, a cat streaks out from under a parked car, a shriek, a bellowed oath and the sound of breaking china, and Harry draws his wand.", "It was Mundungus Fletcher who disapparated from the front of Harry's house.He should have been watching Harry when he left to buy stolen cauldrons.At that moment an owl flies in bringing Harry a letter from the Ministry of Magic.", "Four days later, Uncle Vernon tells Harry they're going out.Someone uses a ¤ Lumos to make some light.Harry meets everybody and is told they're taking him to Headquarters.", "She tells the group which brought Harry that 'He's just arrived, the meeting's started'.Harry is not allowed to join the meeting which is only for members of the Order.Mrs. Weasley joins the meeting after showing Harry to a door with a knob in the shape of a serpent.", "Harry thinks the parchment showed some building plan.Sirius wants to tell Harry about the Order of the Phoenix.Dumbledore thinks Voldemort wants to build up an army of Death Eaters and a great variety of Dark creatures.", "Harry, Ron, Fred and George discuss what they have heard.They wonder what the 'weapon' is and who's got it.George says it's not necessarily big, as 'size is no guarantee of power'; like Ginny, who is smaller, and she has a mean Bat-Bogy Hex.", "Chapter 5-7 The Ministry of Magic Harry wakes up early, ready to go to the hearing.Mr. Weasley tells Harry the hearing will be on his floor, in Amelia Bones' office.Harry sees a fountain with a group of golden statues of a wizard, a witch, a Centaur, a Goblin and a House-elf.", "Chapter 5-8 The Hearing Harry enters Courtroom Ten.When Harry replies he didn't know the time had changed, he gets answered that that is not the Wizengamot's fault and he's told to sit down in a chair in the front.Dumbledore charms a chair and sits next to Harry.", "Chapter 5-9 The Woes of Mrs. Weasley Harry's hearing is over.Harry hurries to leave too and meets outside with Mr. Weasley.They think he may have liked it if Harry had been expelled and could have lived with him.", "Moody prefers to wait till Podmore gets back, otherwise the guard will be one short to take Harry.Sirius goes as Snuffles and together with Moody and Tonks, but without Podmore, they take Harry to Platform nine and three-quarters.Harry says goodby and they get on the train.", "They see a new teacher at the staff table.Harry recognizes her as Umbridge, who works for Fudge, from his trial.After dinner Dumbledore announces that Umbridge will be the new Defense Against the Dark Arts teacher.", "Chapter 5-12 Professor Umbridge Fred and George advertise for people to test their products.Hermione says Lavender also does not believe Harry and Dumbledore.At breakfast Angelina tells Harry she's been made Quidditch Captain.", "Chapter 5-13 Detention with Dolores Harry, Ron and Hermione return to the common room.Harry asks Grubbly-Plank about Hagrid, but she does not give an answer.On their way to the greenhouses Luna tells him she believed Voldemort is back and that Harry fought and escaped from him.", "Chapter 5-14 Percy and Padfoot Harry wakes up and writes a letter to Sirius.In the owlery he sends Hedwig away with the letter.Next Filch storms in, accusing Harry to have ordered Dungbombs.", "Harry gets another week detention and Angelina is furious because he'll miss Quidditch practices again.She also suggests Harry should be the teacher.", "There are not many people inside the bar, only a man at the bar with his head wrapped in dirty bandages, two figures in hoods at a table, and a witch with a black veil beside the fireplace.Harry, Ron and Hermione sit at a table when the other students which Hermione invited arrive.Harry talks with the others when asked about Cedric.", "Hermione says that's not possible, as she has put a jinx on the parchment they signed.Angelina tells Harry and Ron that they will also need permission for the Quidditch team.Harry lets her in and finds out she's hurt.", "She thinks Umbridge simply was looking for an excuse to get Harry's mail.Ron, trying the ¤ Silencio can't make it work, and both he and Harry get extra homework.Angelina comes over to tell Harry she got permission for the Quidditch team.", "Chapter 5-19 The Lion and the Serpent The DA meetings are showing progress.All of them have a Protean Charm to mimic Harry's coin so Harry can set the time.Terry boot asks why she's not in Ravenclaw because of her intelligence, but Hermione says the Sorting Hat considered that but it decided on Gryffindor in the end.", "Dumbledore told them where to look, but they had to take a detour to shake off someone from the Ministry tailing them.Dumbledore told them to bring the Gurg, the Giant chief named Karkus, a gift every day.The first gift they brought him was a branch of Gubraithian Fire and told him it is a gift from Albus Dumbledore with respectful greetings.", "He still does not want to tell what he's keeping in the Forbidden Forest, it's a surprise.Harry sees great black winged horses emerging from the darkness.Christmas is coming and Harry is invited to spend it at the Weasleys.", "Dubledore does not look at Harry but asks how he saw it.Harry says he saw from the Snake's perspective, through its eyes.Dumbledore calls two of the Headmasters in the pictures on the walls, Dilys and Everard, he tells Everard to raise the alarm and both move out of their pictures.", "Chapter 5-23 Christmas on the Closed Ward Harry is back at Grimmauld Place.Phineas Nigellus appears in his frame and talks to Harry, who wants to run away.Hermione has come back from skiing holiday and talks to Harry.", "Chapter 5-24 Occlumency Kreacher turns up again, he seems to have been lurking in the attic and looks in a better mood then before.At Grimmauld Place Harry is called to talk to Professor Snape in the kitchen.Harry is told that Dumbledore want him to learn Occlumency, an obscure branch of magical defense against external penetration.", "Chapter 5-25 The Beetle at Bay They find out why Voldemort was so happy.The next morning Daily Prophet has an article about ten Death Eaters who escaped from Azkaban.The newspaper also contains an article about Broderick Bode who was found dead in his bed at St Mungo's, strangled by a pot plant.", "Hermione explains Harry what 'went wrong' with their date and how he should have had more tact.Ron and Ginny tell that Quidditch practices are not going well.At the Quidditch match they lose by ten points when Ginny finally catches the snitch under Hufflepuff Seeker Summerby's nose.", "Firenze greets Harry and says it was foretold they meet again, all other students are in awe.After class Firenze asks Harry to tell Hagrid that his attempt is not working and he would do better to abandon it.Harry is tackled by a Trip Jinx by Draco.", "Chapter 5-28 Snape's Worst Memory The next day there's an announcement stating Umbridge has replaced Dumbledore.Draco tells them he's member of the Inquisitorial Squad and takes points of Gryffindor House.Filch tells Harry that Umbridge wants to see him.", "Chapter 5-29 Careers Advice Harry feels bad about the way he saw his father.In the library Harry tells Ginny he'd like to talk to Sirius.Harry, Ron and Hermione look at posibilities in some flyers.", "Chapter 5-30 Grawp Fred and George's leaving becomes something of a legend.Ron and Hermione wonder how Fred and George managed to buy a premises and Harry explains he gave them his Triwizard winnings.Hermione urges Harry to take Occlumency lessons again.", "Harry hears Draco bragging that his father is close to the Wizarding Examinations Authority.Hermione accidentally hits Harry in the nose with Achievements in Charming.After Charms theory exam, students are called in alphabetically for practical exam.", "Harry tells them Voldemort's got Sirius inside the Ministry.Hermione thinks it's rather fishy and wonders if Voldemort is trying to get Harry inside the Department of Mysteries.Harry goes to fetch Sirius's knife and the Invisibility cloak.", "Harry sees the red lightflash of a Stunning Spell, and then she is overpowered and taken away.Ronan says Harry and Hermione should not be harmed because they are foals, but other Centaurs don't agree.At that moment Grawp appears and seems to be looking for Hagrid.", "They pass the fountain in the Atrium and the desk where normally the watchwizard is, and enter the elevator to level nine, the Department of Mysteries.Like in his dream they go through the door on the end of the corridor into a large circular completely black room.The try one of the doors and enter a long rectangular room with an enormous tank of green liquid with pearly-white objects in it.", "Malfoy is ordering Harry to give the Prophecy to him.Malfoy tells her to back off and Harry figures out they want the glass sphere unharmed.Harry responds he'll smash the Prophecy first and then asks why Voldemort wants it.", "Harry goes after her through the room with the brains.Harry avoids them by sending them back up in the air with a ¤ Wingardium Leviosa.The door closes when Harry is in the circular room and the walls spin.", "Chapter 5-37 The Lost Prophecy Harry is back in Dumbledore's office.Phineas Nigellus asks Harry why he's in Dumbledore's office.The other Headmasters wake up and Harry wants to leave but the office is locked.", "He also tells that there has been a mass revolt of the Dementors of Azkaban.Harry and Hermione are visiting Ron in the Hospital wing.He wants to take housepoints but Gryffindor has none."], "Harry Potter and the Prisoner of Azkaban": ["On rare occasions when they did catch a real witch or wizard, the witch or wizard would perform a basic Flame-Freezing Charm and pretend to be in pain.The Dursleys locked up Harry's spellbooks, wand, cauldron and broomstick.Harry managed to 'steal' a spellbook back, since he needs it to write an essay about Shrinking Potions.", "Harry hears a news report about an escaped convict, Sirius Black, who is armed and extremely dangerous.Once, when Harry had trodden on the paw of her dog, Ripper, and it had chased Harry into a tree, she had refused to call the dog off until past midnight.Harry takes her suitcase upstairs and goes back to the kitchen.", "Chapter 3-3 The Knight Bus Harry wanders several streets after having fled from the house until reaching Magnolia Crescent.To not make the Ministery of Magic easy to track him, Harry pretends his name is Neville Longbottom.Harry is taken to Diagon Alley, in front of the Leaky Cauldron.", "During breakfast each morning there he watches other witches and wizards arguing over articles in Transfiguration Today, Warlocks and Dwarfs.Harry has refilled his money bag with gold Galleons, silver Sickles and bronze Knuts from his vault at Gringotts and it requires a lot of self-control not to spend everything at once.He sees a set of Gobstones, a wizarding game, and a moving model of the galaxy in a glass ball, but doesn't buy them.", "Chapter 3-5 The Dementor It is their last breakfast at the Leaky Cauldron.Before leaving, Mr. Weasley wants to tell Harry something, but Harry interrupts, telling him that he already knows about Black.Mr. Weasley wants Harry to promise he won't go looking for Black.", "Harry, Hermione and Ron set out for their first Divination class at the top of North Tower.Sir Cadogan, a personage in one of the paintings on the wall, shows them the way.She starts telling them about the Inner Eye, the ability to penetrate the mysteries of the future.", "Harry is then ordered to skin Draco's Shrivelfig.Seamus Finnigan tells Harry that Black has been spotted not far from Hogwarts, according to the Daily Prophet.Draco, overhearing their conversation, starts criticising Harry, saying that if he were in his place, he would go after Black himself.", "Harry is not fond of Professor Trelawney's classes, Parvati Patil and Lavender Brown loved her classes more then anyone.In Hagrid's classes they now were only spending their lessons looking after Flobberworms.After returning from Quidditch practice one day, Harry hears that first Hogsmeade weekend will be at Halloween.", "Chapter 3-9 Grim Defeat Dumbledore orders the whole castle to be searched, to see if Black is still around.Professor McGonagall has Harry's Quidditch training sessions supervised by Madam Hooch.Harry is late for Defense Against the Dark Arts classes.", "Chapter 3-10 The Marauder's Map Harry has to stay in the hospital wing the rest of the weekend.After classes, Lupin wants a word with Harry.He feels sorry for Harry having lost his broomstick.", "Chapter 3-11 The Firebolt Although in shock, somehow Harry had manages to get back through the tunnel to Hogwarts.Ron and Hermione warn Harry not to go after Black himself.Harry tells them about how he hears his mother die every time a Dementor is near.", "Chapter 3-12 The Patronus Harry and Ron are angry at Hermione.Wood seeks Harry to find out if he will be able to play in the next game.Harry has his first Anti-Dementor lesson from Professor Lupin.", "Chapter 3-13 Gryffindor versus Ravenclaw Ron and Hermione are enraged with each other.Harry has his final practice before the match against Ravenclaw.Harry suddenly sees a pair of eyes in the darkness and lights his wand with a ¤ Lumos, to find out it's Crookshanks.", "Chapter 3-14 Snape's Grudge The castle is searched again.Hagrid invites Ron and Harry to visit him in the evening.There is another Hogsmeade trip and Harry decides to go, taking his Invisibility cloak and the Marauder's Map.", "Chapter 3-15 The Quidditch Final Hermione got the letter, stating Buckbeak will be executed, from Hagrid.Harry, Ron and Hermione have Charms class where they practice Cheering Charms.After classes, Harry and Ron go back to Gryffindor tower.", "Chapter 3-16 Professor Trelawney's Prediction Exams are near.Her exam timetable shows various exams at the same time.Ron asks how she plans to do that but she does not answer the question; asking instead if either of them has seen her copy of Numerology and Grammatica.", "Harry sees the reason; Crookshanks is approaching them.Suddenly a black Dog attacks them, jumping on Harry and rolling off og him.When attacking a second time, Ron pushes Harry aside and is caught by the dog and dragged away.", "Lupin stops him, telling him they need to explain everything first since Harry, Ron and Hermione have the right to know everything.Black, Pettigrew and James Potter, his best friends, found out and became Animagi to keep him company during his time as a Werewolf.To save Snape from meeting with a fully grown Werewolf, James Potter pulled snape back at great risk to his own life.", "At the same moment, Harry, Ron and Hermione disarm him with a ¤ Expelliarmus, Snape is knocked out from the blow.Crookshanks has been helping Black to find and capture Scabbers.Pettigrew has in fact been hiding all these years, waiting to see if Voldemort would return.", "Sirius asks Harry if, since he is his godfather, would he like to live with him?Harry is filled with happiness, gladly accepting the offer.When they are almost at the castle, Lupin, who had forgotten to take his potion, transforms into a Werewolf.", "Snape starts telling Fudge that the three, especialy Harry, should be handled much more strictly.Snape had bound and gagged Black when he found them and took Harry, Ron and Hermione straight back to the castle.Madam Pomfrey, who is checking to see if they are alright, tells them that the Dementors will be performing the Kiss any moment now.", "Chapter 3-22 Owl Post Again Harry and Hermione have ten minutes to get back to the hospital wing without beeing seen.Harry and Hermione wait till they have passed and then continue.Madam Pomfrey comes back to take care of them."]}